tutorial/single_phase_falling_Re100/CFD/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    walls
    {
        // type            fixedValue;
        // value           uniform 0;
        type            zeroGradient;
    }
    x2
    {
        // type            fixedValue;
        // value           uniform 0;
        type            zeroGradient;
    }

    x1
    {
        // type            fixedValue;
        // value           uniform 0;
        type            zeroGradient;
    }
    z2
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

}

// ************************************************************************* //
